{
"my mother eats an apple": "Mẹ tôi ăn một quả táo",
"my father drinks water": "Bố tôi uống nước",
"my aunt will visit me in the new year": "Dì tôi sẽ tới thăm tôi vào dịp đầu Năm mới",
"would you marry me?": "Em sẽ cưới anh chứ?",
"Selena and Sally are twin sisters": "Selena và Sally là chị em sinh đôi",
"he has a 3-year-old son named Timmy": "Anh ấy có một người con trai 3 tuổi tên là Timmy"
"Jake’s uncle is a famous MC": "Chú của Jake là một người dẫn chương trình nổi tiếng",
"my father is a farmer": "Bố tôi là một người nông dân",
"i have two brother": "Tôi có hai anh em trai em trai",
"my father is a kind and generous man": "Bố tôi là một người tốt bụng và hào phóng",
"Please knock on the door before coming in": "Xin vui lòng gõ cửa trước khi đi vào",
"He fell off the stairs and broke his arm": "Cậu ấy ngã khỏi cầu thang và bị gãy tay",
"i am in the kitchen": "tôi ở trong bếp",
"my mom is in the living room": "mẹ tôi ở trong phòng khách",
"my house was build in 1990": "Nhà tôi được xây năm 1990",
"please open the door": "Làm ơn mở cửa",
"my room in the 3th floor": "phòng tôi ở tầng 3",
"my yard very large": "sân nhà tôi rất rộng",
"there are many tree in the garden": "có nhiều cây ngoài vườn",
"a bird outside window": "một con chim ở ngoài cửa sổ",
"We went to the park to play baseball.": "Chúng tôi tới công viên để chơi bóng chày",
"France is the World Cup 2018 Champion.": "Pháp là nước vô địch World Cup 2018",
"Every competition has its winner and loser.": "Cuộc thi nào cũng có người thắng và kẻ thua",
"We’ve just had a very good game of chess": "Chúng tôi vừa chơi một ván cờ rất hay"
"He is a sporty boy. He loves sport.": "Cậu ấy là một người mê thể thao",
"i like play football": "Tôi thích chơi bóng đá",
"i play badminton very well": "Tôi chơi cầu lông rất giỏi",
"Messi is best player in the world": "messi là cầu thủ giỏi nhất thế giới",
"baseketball is hard to play": "bóng rổ thì khó để chơi",
"football is famous in VietNam": "bóng đá thì phổ biến ở Việt Nam",
"Their arrival is later than the schedule 30 minutes.": "Họ tới nơi muộn hơn lịch trình 30 phút",
"The 5-year-old boy started to learn how to ride a bike.": "Cậu bé 5 tuổi bắt đầu học cách đi xe đạp",
"Let’s go on a trip on grandpa’s boat!": "Hãy đi chơi một chuyến trên con thuyền của ông nội nào!",
"There is a bus stop right out of my house.": "Có một trạm dừng xe buýt ngay trước nhà tôi",
"I booked a Grab car to go to work.": "Tôi đặt một chiếc xe ô tô Grab để đi làm",
"The heavy rain puts off our plane’s departure.": "Cơn mưa nặng hạt làm hoãn lại sự rời đi của máy bay chúng tôi",
"I drove my mom to the supermarket yesterday.": "Tôi lái xe chở mẹ tới siêu thị vào hôm qua",
"Get on the bus! We are leaving in 5 minutes.": "Lên xe buýt đi! Chúng ta sẽ rời đi trong 5 phút nữa",
"Motorbike is the most common vehicle in Vietnam.": "Xe máy là phương tiện giao thông phổ biến nhất ở Việt Nam",
"This filght has 285 passengers.": "Chuyến bay này có 285 hành khách",
"There is a bus stop just around the corner.": "Có một bến xe buýt ở ngay bên kia góc phố",
"They are going to a café to meet some friends.": "Họ đang đến một quán cà phê để gặp vài người bạn",
"I’m a town dweller.": "Tôi là một cư dân thị trấn",
"Where is the nearest gas station?": "Trạm xăng gần nhất là ở đâu?",
"We have to stay at this hotel for 3 nights.": "Chúng ta phải ở lại khách sạn này trong 3 đêm",
"The road is blocked for construction.": "Con đường bị chặn lại để thi công",
"This street is full of stores.": "Con phố này đầy rẫy các cửa hàng",
"Kim’s favorite supermarket is VinMart.": "Siêu thị yêu thích của Kim là VinMart",
"my house nears two supermarket": "nhà tôi gần 2 siêu thị",
"Ha Noi is capital of VietNam": "Hà Nội là thủ đô của Việt Nam",
"Medical students have to be good at Biology.": "Sinh viên ngành Y cần phải giỏi môn Sinh học",
"There are 30 students in a regular class in Vietnam.": "Có 30 học sinh trong một lớp học thông thường ở Việt Nam",
"Computer science is a new subject this semester.": "Tin học là một môn học mới trong kì này",
"He has a degree in External Economics.": "Anh ấy có một tấm bằng ngành Kinh tế Đối ngoại",
"I have just lost my eraser at school.": "Tớ vừa làm mất cục tẩy của mình ở trường",
"To learn is to grow.": "Học hỏi là cách để lớn lên",
"I forgot my pen.": "Tớ quên bút rồi.",
"Can I borrow one from you?": "Tớ mượn một cái của cậu được chứ?",
"Use pencil only in this exam.": "Chỉ dùng bút chì trong bài thi này",
"Physics is an applicable science.": "Vật lí là một môn khoa học áp dụng được trong cuộc sống",
"Ruler is used to measure things.": "Thước kẻ được dùng để đo đạc",
"A school year consists of 2 semesters.": "Một năm học bao gồm 2 học kì",
"an apple": "một quả táo",
"he is a boy": "anh ấy là một cậu bé",
"he is a man and i am a boy": "Anh ấy là một người đàn ông và tôi là một cậu bé",
"she is a girl and i am a boy": "cô ấy là một cô bé và tôi là một cậu bé",
"i eat and drink": "Tôi ăn và uống",
"he eats bread": "Anh ấy ăn bánh mì",
"he goes to school": "Anh ấy đi đến trường",
"he learns math": "Anh ấy học toán",
"my name is hoa": "Tôi tên là Hoa",
"i have a bike": "Tôi có một chiếc xe đạp",
"Your dress is so beautiful!": "Chiếc váy của bạn thật là đẹp!",
"It seems this shirt doesn't suit me.": "Có vẻ như chiếc áo này không hợp với tôi.",
"This dress is designed by Victoria Beckham": "Chiếc váy này được thiết kế bởi Victoria Beckham.",
"That pants are very suitable for the shirt you are wearing.": "Chiếc quần đó rất hợp với chiếc áo bạn đang mặc.",
"She’s always very well dressed.": "Cô ấy luôn ăn mặc rất đẹp.",
"That shirt is 50% off.": "Chiếc áo đó đang được giảm giá 50%.",
"My boss wants all staff to wear uniforms.": "Sếp tôi muốn tất cả nhân viên mặc đồng phục.",
"I always follow the latest fashion trends.": "Tôi luôn theo dõi các xu hướng thời trang mới nhất.",
"This scarf looks very attractive.": "Chiếc khăn này trông rất ấn tượng.",
"This shirt has a very nice design.": "This shirt has a very nice design.",
"The sun raises in the east.": "Mặt trời mọc hướng Đông.",
"The Earth is 152.07 million kilometers from the sun": "Trái đất cách mặt trời 152,07 triệu kilomet.",
"The phone was invented in 1876": "Điện thoại được phát minh vào năm 1876",
"One kilogram is equal to one thousand grams": "Một ki lô gam bằng 1000 gam",
"Lithium is the lightest metal.": "Liti là kim loại nhẹ nhất.",
"Neil Armstrong is the first man to set foot on the moon.": "Neil Amstrong là người đầu tiên đặt chân lên mặt trăng.",
"In the past, people believed that the Earth was flat.": "In the past, people believed that the Earth was flat.",
"Science is an interesting subject!": "Khoa học là một môn học thú vị!",
"Albert Einstein is a great scientist.": "Albert Einstein là một nhà khoa học vĩ đại.",
"Dinosaurs went extinct 65 million years ago.": "Khủng long đã tuyệt chủng 65 triệu năm trước.",
"He works in a software company.": "Anh ấy làm việc trong một công ty phần mềm.",
"I arrived 30 minutes late for the meeting.": "Tôi đã đến cuộc họp muộn 30 phút.",
"They are my colleagues.": "Họ là đồng nghiệp của tôi.",
"This work is very boring.": "Công việc đó rất tẻ nhạt.",
"I have to finish my task before tomorrow.": "Tôi phải hoàn thành nhiệm vụ của mình trước ngày mai.",
"My father retired after 30 years working for the government.": "Cha tôi đã nghỉ hưu sau 30 năm làm việc cho chính phủ.",
"Our company has signed a big contract.": "Công ty chúng ta đã ký một hợp đồng lớn.",
"Can you show me the quarterly budget report?": "Anh có thể cho tôi xem bản báo cáo ngân sách hàng quý không?",
"He is very careful at work.": "Anh ấy rất cẩn thận trong công việc.",
"She works at google": "Cô ấy làm việc tại google.",
"Hoang Sa and Truong Sa belongs to Vietnam": "Hoàng Sa và Trường Sa là của Việt Nam.",
"I think Donald Trump will be re-elected as US president.": "Tôi nghĩ Donald Trump sẽ tái trúng cử tổng thống Mỹ.",
"The UK will officially leave the EU on 1st January 2021.": "Vương quốc Anh sẽ chính thức rời khỏi EU vào ngày 1 tháng 1 năm 2021.",
"The trade war between the US and China is not over.": "chiến tranh thương mại giữa Mỹ và Trung Quốc vẫn chưa kết thúc.",
"The US lost the Vietnam War.": "Hoa Kỳ đã thua cuộc chiến tranh Việt Nam.",
"Protests took place in Hong Kong to protest the extradition bill from China.": "Các cuộc biểu tình đã diễn ra tại Hồng Kông để phản đối dự luật dẫn độ từ Trung Quốc.",
"Black lives matter": "Mạng sống của người da đen cũng đáng giá.",
"Say no to racism.": "Nói không với phân biệt chủng tộc",
"Crimea returned to Russia in 2014.": "Criema trở về với Nga năm 2014.",
"NATO opposes Turkey's purchase of Russian weapons.": "NATO phản đối việc Thổ Nhĩ Kỳ mua vũ khí Nga.",
"The Renaissance period originated in Italy in the 15th century.": "Thời kỳ Phục Hưng bắt nguồn từ Ý vào thế kỉ XV.",
"Tango is a famous Argentine dance.": "Tango là điệu nhảy nổi tiếng của Argentina.",
"Adele is a singer with a powerful voice.": "Adele là một ca sĩ có giọng hát đầy nội lực.",
"The Mona Lisa was painted by Leonardo da Vinci in the early 16th century.": "Bức tranh Mona Lisa được vẽ bởi Leonardo da Vinci vào đầu thế kỷ 16.",
"Despasito is the most popular video in youtube with 6.8 billion views": "Despacito là video phổ biến nhất trên youtube với 6,7 tỷ lượt xem.",
"Waka Waka is considered the best world cup song.": "Waka Waka được đánh giá là bài hát world cup hay nhất.",
"Avengers Endgame has become the best selling movie of all time.": "Avengers: Hồi kết đã trở thành bộ phim ăn khách nhất mọi thời đại.",
"I love you three thousand": "Con yêu cha 3000",
"I am a believer of cinema.": "Tôi là một tín đồ của điện ảnh.",
"The parasite movie won four oscar awards in 2020.": "Bộ phim ký sinh trùng đã thắng bốn giải oscar năm 2020.",
"Hospital A is highly rated for cancer treatment.": "Bệnh viện A được đánh giá rất cao trong điều trị bệnh ung thư.",
"Medicine is constantly growing.": "Y học đang không ngừng phát triển.",
"Covid-19 is spreading rapidly all over the world.": "Covid-19 đang lây lan nhanh chóng trên thế giới.",
"You should see a doctor every 6 months.": "Bạn nên đi khám bác sĩ 6 tháng một lần.",
"Today, family doctor services are increasingly popular.": "Ngày nay, dịch vụ bác sĩ gia đình ngày càng phổ biến.",
"You should pay more attention to your health.": "Bạn nên chú ý nhiều hơn đến sức khỏe của mình.",
"Due to drinking too much cold water, I had a sore throat.": "Do uống quá nhiều nước lạnh, tôi đã bị đau họng.",
"In an emergency, call 115.": "Trong trường hợp khẩn cấp, hãy gọi 115.",
"The doctor advised me not to eat sweets.": "Bác sĩ khuyên tôi không nên ăn đồ ngọt.",
"In Switzerland, Healthcare and education are free.": "Ở Thụy Sỹ,  y tế và giáo dục là miễn phí.",
"he is playing with his dog ": "anh ấy đang chơi với con chó của mình",
"Goose is a kind of poultry": "Ngỗng là một loại gia cầm",
"Elk is a large deer": "Nai sừng tấm là một con nai lớn",
"An octopus has 8 legs": "Một con bạch tuộc có 8 chân",
"A lamp is eaten by a wolf": "Một con đèn bị sói ăn",
"Goats give us their milk": "Dê cho chúng tôi sữa",
"His farm is full of pigs": "Trang trại của anh ấy đầy lợn",
"Shark is animal species are at risk of extinction": "Cá mập là loài động vật có nguy cơ tuyệt chủng",
"T rex is huge carnivore that extincted millions years ago": "khủng long bạo chúa là loài thú ăn thịt khổng lồ đã tuyệt chủng từ hàng triệu năm trước",
"Rabbit lives in forest and eats carrots": "Thỏ sống trong rừng và ăn cà rốt",
"There is a coconut tree in my garden": "Trong vườn nhà e có 1 cây dừa",
"I really like cherry blossoms": "Em rất thích hoa anh đào",
"Cactus has lots of thorns on its body": "Cây xương rồng có rất nhiều gai trên thân",
"many species of deciduous trees in the winter": "nhiều loài cây rụng lá vào mùa đông",
"Apple tree is a fruit tree": "Cây táo là cây ăn quả",
"plants help with air conditioning": "cây cối giúp điều hòa không khí",
"Many forest fires occur in Australia every year": "Nhiều vụ cháy rừng xảy ra tại Australia hằng năm",
"Royal poinciana blooms in the school yard": "Hoa phượng nở đỏ rực cả sân trường",
"Mangroves help prevent landslides and protect the soil": "rừng ngập mặn giúp chống sói lở và bảo vệ đất",
"Banyan trees have a very long service life": "Cây đa có tuổi thọ rất dài",
"I have a lemon": "tôi có một quả chanh",
"Mango has an oval shape": "Xoài có hình bầu dục",
"I really like eating apples": "Tôi rất thích ăn táo",
"Watermelon is my favorite fruit": "Dưa hấu là loại trái cây yêu thích của tôi",
"Banana has an acrid taste when it's still green": "Chuối có vị chát khi còn xanh",
"His neighbor grew all kinds of fruits and vegetables": "Hàng xóm của anh ấy trồng đủ loại trái cây và rau",
"I really like drinking orange juice": "Tôi rất thích uống nước cam",
"I have never eaten durian": "Tôi chưa bao giờ ăn sầu riêng",
"Grapefruit is very popular in Vietnam": "Bưởi rất phổ biến ở Việt Nam",
"Young plums are greenish white": "Những quả mận non có màu trắng xanh",
"Can you take me to the airport, please?": "Anh có thể đưa tôi tới sân bay được không?",
"Ha Long beach is a wonder of the world": "Bãi biển Hạ Long là 1 kì quan thế giới",
"Vietnam has many attractive tourist destinations.": "Việt Nam có rất nhiều điểm du lịch hấp dẫn",
"I will travel to Tokyo next weekend ": "Tôi sẽ đi du lịch Tokyo vào cuối tuần tới",
"Many tourists return to Vietnam every year": "Nhiều khách du lịch quay lại Việt Nam  mỗi năm",
"Vietnam has 7 wonders of the world": "Việt Nam có 7 kì quan thế giới",
"I'm saving money to travel": "Tôi đang để giành tiền để đi du lịch",
"Vietnamese people are very enthusiastic with tourists": "Người Việt Nam rất hiếu khách",
"I have made new friends while traveling": "tôi có thêm nhiều bạn mới khi đi du lịch",
"I have a trip to Danang on the weekends": "Tối có chuyến du lịch Đà Nẵng vào cuối tuần",
"good morning": "buổi sáng tốt lành",
"Time passes quickly": "thời gian trôi qua rất nhanh",
"I have a meeting at 8:30 am": "tôi có cuộc họp vào lúc 8:30 sáng",
"I returned home at 6:30 pm": "Tôi trở về nhà lúc 6:30 chiều",
"What time is it?": "Mấy giờ rồi?",
"Are you free on Thursday morning?": "Bạn có rảnh vào sáng thứ năm không?",
"What are your plans for the weekend?": "Bạn có kế hoạch gì vào cuối tuần?",
"What time do you have lunch?": "Bạn ăn trưa lúc mấy giờ?",
"The match has started 30 minutes": "Trận đấu đã bắt đầu được 30 phút",
"I have a party overnight": "Tôi có một bữa tiệc qua đêm",
"She looks so sexy": "cô ấy trông thật quyến rũ",
"They come from elsewhere": "Họ đến từ nơi khác",
"They just got married last month": "Họ mới kết hôn vào tháng trước",
"He looks very manly": "Anh ấy trông rất đàn ông",
"My family has four people": "Gia đình tôi có 4 người",
"My brother is three years older than me": "Anh trai tôi hơn tôi 3 tuổi",
"She has brown eyes": "Cô ấy có đôi mắt nâu",
"The Vietnamese people are very friendly": "Người việt nam rất thân thiện",
"the boy is sick":"Cậu bé bị ốm",
"I really love my parents": "tôi rất yêu bố mẹ tôi"
}
